
## Plan Result

[CI link](https://github.com/NaokiYazawa/bined-infra/actions/runs/5707202275)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.ecs.aws_ecs_service.ecs_service
  * module.ecs.aws_ecs_task_definition.ecs_task_definition


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.ecs.aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = "arn:aws:ecs:ap-northeast-1:761817748648:cluster/bined-hasura"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "bined-hasura"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "bined-hasura"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:targetgroup/bined-hasura-alb-target-group/dd6db5e43b282fe2"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0ff51e5c4d89f1d35",
            ]
          + subnets          = [
              + "subnet-04e257e755c87b631",
              + "subnet-0f0bc25f4fe692b9f",
            ]
        }
    }

  # module.ecs.aws_ecs_task_definition.ecs_task_definition will be created
  + resource "aws_ecs_task_definition" "ecs_task_definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment  = [
                      + {
                          + name  = "HASURA_GRAPHQL_ADMIN_SECRET"
                          + value = "password"
                        },
                      + {
                          + name  = "HASURA_GRAPHQL_DEV_MODE"
                          + value = "true"
                        },
                      + {
                          + name  = "HASURA_GRAPHQL_ENABLED_LOG_TYPES"
                          + value = "startup, http-log, response-caching-log, webhook-log, websocket-log, query-log"
                        },
                      + {
                          + name  = "HASURA_GRAPHQL_ENABLE_CONSOLE"
                          + value = "true"
                        },
                      + {
                          + name  = "HASURA_GRAPHQL_JWT_SECRET"
                          + value = "{ 'type': 'HS256', 'key': '69f8fd4d54342b7ee3b0fcdf6def434c' }"
                        },
                      + {
                          + name  = "HASURA_GRAPHQL_MAX_CACHE_SIZE"
                          + value = "200"
                        },
                      + {
                          + name  = "HASURA_GRAPHQL_METADATA_DATABASE_URL"
                          + value = "postgres://hasurauser:vw:l+ySQ*uIN$.hMS5kt1n%&[(9Q@bined-hasura.c8dzjeklcznk.ap-northeast-1.rds.amazonaws.com:5432/hasuradefault"
                        },
                      + {
                          + name  = "HASURA_GRAPHQL_SERVER_PORT"
                          + value = "8080"
                        },
                      + {
                          + name  = "PG_DATABASE_URL"
                          + value = "postgres://hasurauser:vw:l+ySQ*uIN$.hMS5kt1n%&[(9Q@bined-hasura.c8dzjeklcznk.ap-northeast-1.rds.amazonaws.com:5432/hasuradefault"
                        },
                    ]
                  + essential    = true
                  + healthCheck  = {
                      + command     = [
                          + "CMD-SHELL",
                          + "curl -f http://localhost:8080/healthz || exit 1",
                        ]
                      + interval    = 30
                      + retries     = 3
                      + startPeriod = 30
                      + timeout     = 5
                    }
                  + image        = "hasura/graphql-engine:v2.30.0"
                  + name         = "bined-hasura"
                  + portMappings = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 8080
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::761817748648:role/ecs-task-execution-role-name-dev"
      + family                   = "bined-hasura"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = "arn:aws:iam::761817748648:role/ecs-task-execution-role-name-dev"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":12,"Program":"tfcmt","SHA1":"dca84b1abc9bdb1509d1d970d6c916fa0ccd9c4d","Vars":{},"WorkflowName":"Terraform"} -->